<a href="https://colab.research.google.com/github/Darraj/DataCo/blob/main/Gituh_DS_Order_Items.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import csv, sqlite3, pandas
ddb_connection = sqlite3.connect('testdb.db')
print("success")
cursor = ddb_connection.cursor()
url = 'https://raw.githubusercontent.com/Darraj/DataCo/main/DS2.2-order_items_99999.csv'
df = pandas.read_csv(url, error_bad_lines=False)
df.to_sql('customers', ddb_connection, if_exists='append', index=False)

success

In [2]:
data = pandas.read_sql_query('select * from customers',ddb_connection)
data

       order_item_id  ...  order_item_product_price
0                  1  ...                299.980011
1                  2  ...                199.990005
2                  3  ...                 50.000000
3                  4  ...                129.990005
4                  5  ...                 24.990000
...              ...  ...                       ...
99994          99995  ...                299.980011
99995          99996  ...                 50.000000
99996          99997  ...                 50.000000
99997          99998  ...                199.990005
99998          99999  ...                 24.990000

[99999 rows x 6 columns]

In [3]:
data = pandas.read_sql_query('select avg(order_item_product_price) from customers',ddb_connection)
data

   avg(order_item_product_price)
0                     131.362694